// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет
int number = new Random().Next(1, 7);
Console.WriteLine($"Любое число диапазона от 1 до 7 -> {number}");
//   Console.WriteLine("Введите номер от 1 до 7");
//   string? number= Console.ReadLine();
 int firstDigit =

  
